# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
url = "https://raw.githubusercontent.com/ratul-sraj/pandas_excercises/refs/heads/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
baby_name = pd.read_csv(url)

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_name.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [3]:
baby_name.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_name.drop(["Unnamed: 0","Id"],axis=1,inplace=True)
baby_name.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [5]:
baby_name.Gender.value_counts().sort_values()
print("Yes there are more females in the database")

Yes there are more females in the database


### Step 7. Group the dataset by name and assign to names

In [6]:
baby_name.drop(["Year","Gender","State"],axis= 1,inplace=True)
names = baby_name.groupby("Name").sum()

### Step 8. How many different names exist in the dataset?

In [18]:
names.shape

(17632, 1)

### Step 9. What is the name with most occurrences?

In [17]:
names.sort_values("Count").iloc[-1,:]

Count    242874
Name: Jacob, dtype: int64

### Step 10. How many different names have the least occurrences?

In [31]:
names.Count.min()

np.int64(5)

In [30]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [36]:
names[names.Count == names.Count.median()]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [37]:
names.Count.std()

np.float64(11006.06946789057)

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [38]:
names.Count.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64